//
//  MarketData.swift
//  Cryptonos
//
//  Created by Христиченко Александр on 2023-02-12.
//

import Foundation
//JSON Data
/*
 URL: https://api.coingecko.com/api/v3/global
 
 JSON Respose:
 {
   "data": {
     "active_cryptocurrencies": 12336,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 659,
     "total_market_cap": {
       "btc": 48934926.39741721,
       "eth": 697505668.3235584,
       "ltc": 11438335537.763844,
       "bch": 8527676313.080972,
       "bnb": 3380224184.260946,
       "eos": 1011389196940.9696,
       "xrp": 2800906154647.724,
       "xlm": 12396093452352.793,
       "link": 153481210743.42908,
       "dot": 169370827814.92242,
       "yfi": 149657031.97900882,
       "usd": 1077678571809.9434,
       "aed": 3958313394257.932,
       "ars": 204897884518939.03,
       "aud": 1558917015730.2502,
       "bdt": 112769226567585.73,
       "bhd": 405193133179.10614,
       "bmd": 1077678571809.9434,
       "brl": 5620246782346.073,
       "cad": 1442957723724.9275,
       "chf": 996834358388.4808,
       "clp": 868230421222431.1,
       "cny": 7338344466882.644,
       "czk": 23956794651335.1,
       "dkk": 7516484734802.848,
       "eur": 1007145586963.5553,
       "gbp": 893300700316.1249,
       "hkd": 8459722904779.504,
       "huf": 390647705495387.1,
       "idr": 16367512729006502,
       "ils": 3805935032596.8633,
       "inr": 88896735477887.98,
       "jpy": 141633951476407.6,
       "krw": 1366464098697857,
       "kwd": 328715673330.61304,
       "lkr": 393205785732899.6,
       "mmk": 2262277375351477.5,
       "mxn": 20111637507117.2,
       "myr": 4669042412366.586,
       "ngn": 496623661252534.75,
       "nok": 10959560003878.426,
       "nzd": 1708431985426.0173,
       "php": 58706543432382.73,
       "pkr": 290191174301801.5,
       "pln": 4813782188310.666,
       "rub": 78777673157342.61,
       "sar": 4042733345180.6616,
       "sek": 11292390253996.193,
       "sgd": 1433635804078.7705,
       "thb": 36244839205683.65,
       "try": 20286438049143.367,
       "twd": 32544168582945.44,
       "uah": 39584459487222.625,
       "vef": 107907955395.3298,
       "vnd": 25414354919708052,
       "zar": 19321269120230.344,
       "xdr": 801827343140.8977,
       "xag": 48959821213.75481,
       "xau": 577689598.4187226,
       "bits": 48934926397417.21,
       "sats": 4893492639741721
     },
     "total_volume": {
       "btc": 2188957.33309146,
       "eth": 31200826.48433897,
       "ltc": 511659673.30586046,
       "bch": 381460052.64522415,
       "bnb": 151204202.4042285,
       "eos": 45241465804.47841,
       "xrp": 125290145870.96094,
       "xlm": 554502104362.9657,
       "link": 6865522163.456591,
       "dot": 7576296581.020575,
       "yfi": 6694458.9829084715,
       "usd": 48206722399.47244,
       "aed": 177063291373.26273,
       "ars": 9165493030685.979,
       "aud": 69733482493.67947,
       "bdt": 5044393516349.454,
       "bhd": 18125100934.810486,
       "bmd": 48206722399.47244,
       "brl": 251404902667.83044,
       "cad": 64546390956.773796,
       "chf": 44590398705.23139,
       "clp": 38837686847900.06,
       "cny": 328258855506.9683,
       "czk": 1071635438940.275,
       "dkk": 336227426719.602,
       "eur": 45051640625.14941,
       "gbp": 39959130677.591545,
       "hkd": 378420360499.7404,
       "huf": 17474454802584.797,
       "idr": 732151648122589.1,
       "ils": 170247101859.58923,
       "inr": 3976529144682.3394,
       "jpy": 6335570512176.471,
       "krw": 61124677800859.21,
       "kwd": 14704110879.731903,
       "lkr": 17588882858510.818,
       "mmk": 101196201053730.14,
       "mxn": 899633853418.9562,
       "myr": 208855624795.71463,
       "ngn": 22214971700516.176,
       "nok": 490243084113.6761,
       "nzd": 76421586745.93744,
       "php": 2626061347331.444,
       "pkr": 12980832827407.24,
       "pln": 215330125061.02066,
       "rub": 3523883206468.843,
       "sar": 180839564972.4253,
       "sek": 505131248259.52844,
       "sgd": 64129402808.01831,
       "thb": 1621304299544.0076,
       "try": 907453031998.8741,
       "twd": 1455765885708.2305,
       "uah": 1770692208001.1775,
       "vef": 4826939113.859182,
       "vnd": 1136835030985561.5,
       "zar": 864279091417.9049,
       "xdr": 35867344080.32436,
       "xag": 2190070928.120409,
       "xau": 25841213.542237315,
       "bits": 2188957333091.4602,
       "sats": 218895733309146.03
     },
     "market_cap_percentage": {
       "btc": 39.41730869961636,
       "eth": 17.277745660741882,
       "usdt": 6.346472779660198,
       "bnb": 4.672939545229812,
       "usdc": 3.828599746607072,
       "xrp": 1.8139534118295746,
       "busd": 1.4972264595902607,
       "ada": 1.2127702059045153,
       "doge": 1.0838898595923776,
       "matic": 1.0763281065138506
     },
     "market_cap_change_percentage_24h_usd": 1.7185138736435044,
     "updated_at": 1676222688
   }
 }
 */


struct GlobalData: Codable {
    let data: MarketData?
}

struct MarketData: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
            return item.value.asPercentString()
        }
        return ""
    }
}
